/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 18:13:15 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/08 18:15:05 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* Функция конвертирует чар в инт, и возвращает полученное число.*/

#include "libft.h"

int	ft_atoi(const char *str)
{
	char	*p;
	int		x;
	int		minus;

	x = 0;
	minus = 1;
	p = (char *)str;
	while (*p == '\t' || *p == '\n' || *p == '\v' || *p == '\f' || *p == '\r'
		|| *p == ' ')
		p++;
	if (*p == 45 || *p == 43)
	{
		if (*p == 45)
			minus *= -1;
		p++;
	}
	while (*p >= '0' && *p <= '9')
	{
		x = x * 10 + (*p - '0');
		p++;
	}
	return (x * minus);
}
