/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 18:18:50 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/08 18:18:54 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* Возвращает 1, если число принадлежит кодировки аскии, возвращает 0,
 * если нет.*/

#include "libft.h"

int	ft_isascii(int c)
{
	if (c >= 0 && c <= 127)
		return (1);
	return (0);
}
