/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 18:17:28 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/08 18:17:39 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* Макрос, возвращающий кодовый номер числа или символа, если это число или
 символ, если нет, то
 возврвщает 0.*/

#include "libft.h"

int	ft_isalnum(int c)
{
	if ((ft_isalpha(c) || ft_isdigit(c)) > 0)
		return (c);
	return (0);
}
