/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/09 17:54:14 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/09 17:54:56 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*Функция возвращает ууказатель на конец последний элемент листа*/

#include "libft.h"

t_list	*ft_lstlast(t_list *lst)
{
	if (lst)
		while (lst->next)
			lst = lst->next;
	return (lst);
}
