/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/09 18:02:04 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/09 18:02:36 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*Функция подсчитывает кол-во элементов в списке*/

#include "libft.h"

int	ft_lstsize(t_list *lst)
{
	int		i;
	t_list	*temp;

	i = 0;
	if (!lst)
		return (0);
	temp = lst;
	while (temp->next != NULL)
	{
		i++;
		temp = temp->next;
	}
	i++;
	return (i);
}
