/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mrudge <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 18:27:08 by mrudge            #+#    #+#             */
/*   Updated: 2021/10/08 18:27:17 by mrudge           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*Стрчр ищет в массиве первый схожий по размеру байт, если находит, то
возвращает указатель на него, если нет, то возвращает нул.*/

#include "libft.h"

char	*ft_strchr(const char *str, int ch)
{
	char	*p;
	char	i;

	i = (char)ch;
	p = (char *)str;
	while (*p && *p != ch)
		p++;
	if (*p == ch)
		return (p);
	return (NULL);
}
